<!DOCTYPE html>

<html>
    <head>
        <title>Manual</title>
        <meta charset="UTF-8">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <link rel="stylesheet" type="text/css" href="style.css">
    </head>
    <body>

        <h1>Programa Escrita Criativa</h1>

        <p><strong>Escrita Criativa</strong> &eacute; um programa de exerc&iacute;cio de 
            escrita cujo p&uacute;blico alvo s&atilde;o escritores em geral que queiram 
            experimentar novos paradigmas de produ&ccedil;&atilde;o liter&aacute;ria. A ideia do
            desenvolvimento deste software surgiu ap&oacute;s uma atividade de escrita
            criativa realizada em uma das reuni&otilde;es da Academia Paragua&ccedil;uense de
            Letras. Nesta atividade, cartas de baralho com diferentes imagens
            foram distribu&iacute;das pela mesa com as imagens viradas para baixo,
            cada pessoa pegou aleatoriamente cinco cartas e criou um texto a
            partir das ideias sugeridas pelos desenhos nas cartas. Escrita
            Criativa &eacute; uma vers&atilde;o digital deste exerc&iacute;cio.</p>

        <h2>Como funciona</h2>

        <p>A interface do programa &eacute; composta por dois pain&eacute;is: o painel da 
            direita &eacute; um editor de texto onde o usu&aacute;rio pode digitar, o painel
            da esquerda exibe imagens aleat&oacute;rias sugerindo ideias para a cria&ccedil;&atilde;o
            do texto. Inicialmente, deve-se clicar em <strong>Arquivo 
            &Rarr; novo</strong> para iniciar um novo trabalho. Na
            janela que abrir, digite um nome para seu arquivo ou clique em 
            <strong>BROWSER</strong> para selecionar uma pasta onde guardar seu
            arquivo, este ser&aacute; salvo no formato xml, contendo seu texto e um
            hist&oacute;rico das imagens utilizadas como inspira&ccedil;&atilde;o para a escrita do
            texto. Em seguida, selecione a fonte de suas imagens, ou seja, a 
            pasta que cont&eacute;m arquivos de imagem nos formatos png e/ou jpeg. É
            poss&iacute;vel selecionar uma ou mais pastas como fonte de imagens. Marque
            a caixa <strong>Biblioteca padr&atilde;o</strong> para usar a biblioteca de
            imagens que vem junto com o programa (neste caso, n&atilde;o &eacute; necess&aacute;rio
            adicionar outras pastas como fonte de imagens, embora seja poss&iacute;vel)
            . Clique em <strong>ADICIONAR </strong> para selecionar outras
            pastas de seu computador como fonte de imagens. Se quiser remover
            uma pasta selecionada anteriormente, clique no nome da pasta e em
            seguida no bot&atilde;o <strong>Remover</strong>. Clique em <strong>OK
            </strong> para fechar a janela de di&aacute;logo e iniciar seu texto.</p>

        <p> Uma imagem aleat&oacute;ria ser&aacute; exibida no painel esquerdo, comece a 
            escrever seu texto baseado nas impress&otilde;es provocadas pela imagem.
            Pode ser uma palavra, uma frase, um par&aacute;grafo ou um texto maior.
            Clique no bot&atilde;o <strong>PRÓXIMA</strong> para exibir uma nova imagem
            e continuar seu texto. Clique em <strong>ANTERIOR</strong> para
            rever as imagens anteriores. Para salvar seu trabalho, clique em
            <strong>Arquivo &Rarr; salvar</strong>, ser&aacute; salvo o
            arquivo em xml. Para salvar uma vers&atilde;o do texto no formato txt,
            clique em <strong>Arquivo &Rarr; salvar como txt</strong>.
            Se quiser abrir um trabalho salvo anteriormente, clique em <strong>
                Arquivo &Rarr; abrir</strong>, apenas arquivos xml podem
            ser abertos.</p>

        <h2>Cr&eacute;ditos</h2>

        <p> Este programa foi desenvolvido por Thiago Castilho Elias, membro da
            Academia Paragua&ccedil;uense de Letras. Qualquer sugest&atilde;o, cr&iacute;tica ou
            coment&aacute;rio, enviar e-mail para tcastilho31@yahoo.com.br</p>
        <p> As imagens contidas na Biblioteca Padr&atilde;o foram obtidas no site
            https://www.wpclipart.com/downloads.html, sendo utilizada a
            biblioteca cartoon.zip, a qual contem um conjunto de 1922 imagens.
        </p>


    </body>
</html>
